Repository: BoyNextDoor-228/fitapp
Catalog: app/lib/l10n/intl_*.arb
Languages: ru

source: Reps
ru: Повторы

source: Timer
ru: Таймер

source: Proteins
ru: Белки

source: Fats
ru: Жиры

source: Carbohydrates
ru: Углеводы

source: Kilocalories
ru: Килокалории

source: Edit
ru: Изменить

source: Delete
ru: Удалить

source: Deletion
ru: Удаление

source: No
ru: Нет

source: Yes
ru: Да

source: Home
ru: Домой

source: Trainings
ru: Тренировки

source: Meals
ru: Блюда

source: Products
ru: Продукты

source: Settings
ru: Настройки

# yourCurrentWeightN
source: Your current weight: {userWeight}
ru: Ваш вес: {userWeight}

source: Exit
ru: Выйти

source: New Meal
ru: Новое Блюдо

source: Fill the form to create a new meal
ru: Заполните форму, чтобы создать новое блюдо

source: Meal added!
ru: Блюдо добавлено!

source: Create
ru: Создать

source: Edit Meal
ru: Изменить Блюдо

source: Fill the form to edit meal
ru: Заполните форму, чтобы изменить блюдо

source: Meal edited!
ru: Блюдо изменено!

source: Save changes
ru: Сохранить изменения

source: Meals list
ru: Список блюд

source: No meals
ru: Нет блюд

source: Meal information
ru: Инофрмация о блюде

source: Grams
ru: Граммы

source: Milliliters
ru: Миллилитры

source: Select product
ru: Выберите продукт

source: Enter ingredient amount
ru: Введите кол-во ингредиента

source: Enter amount
ru: Введите кол-во

source: Make sure fractional number is correct
ru: Убедитесь, что дробь написана правильно

source: Enter valid number
ru: Введите правильное число

source: Number must be non-negative
ru: Число должно быть неотрицательным

source: New meal title
ru: Название нового блюда

source: New meal recipe (optional)
ru: Рецепт нового блюда (необязательно)

# noIngredientsYet
source: No ingredients yet. Press 'Add ingredient' button to create one.
ru: Ещё нет ингредиентов. Нажмите кнопку 'Добавить ингредиент' для добавления

source: Add ingredient
ru: Добавить ингредиент

source: Create a new ingredient
ru: Создать новый ингредиент

source: Enter title
ru: Введите название

source: {ingredientAmount} ml.
ru: {ingredientAmount} мл.

source: {ingredientAmount} gr.
ru: {ingredientAmount} гр.

source: Are you sure you want to delete this {object}?
ru: Вы уверены, что хотите удалить {object}?

source: Ingredient editing
ru: Изменение ингредиента

source: No recipe
ru: Рецепт отсутствует

source: Total ingredients: {N}
ru: Всего ингредиентов: {N}

source: Product added!
ru: Продукт добавлен!

source: New product
ru: Новый продукт

source: Fill the form to create a new product
ru: Заполните форму, чтобы создать новый продукт

source: Product edited!
ru: Продукт изменён!

source: Edit Product
ru: Изменить Продукт

source: Fill the form to edit the product
ru: Заполните форму, чтобы изменить продукт

source: Products list
ru: Список продуктов

source: No products
ru: Нет продуктов

source: New product name
ru: Название нового продукта

source: Proteins amount
ru: Количество белков

source: Fats amount
ru: Количество жиров

source: Carbohydrates amount
ru: Количество углеводов

source: Kilocalories amount
ru: Количество килокалорий

source: Dark Mode
ru: Тёмный режим

source: Interface main color
ru: Главный цвет интерфейса

source: Select color
ru: Выберите цвет

source: Interface contrast level
ru: Уровень контраста интерфейса

source: Low
ru: Низкий

source: Medium
ru: Средний

source: High
ru: Высокий

source: Exercises statistics
ru: Статистика упражнений

source: Exercises are absent
ru: Упражнения отсутствуют

source: New Training
ru: Новая тренировка

source: Fill the form to create a new training
ru: Заполните форму, чтобы создать новую тренировку

source: Training added!
ru: Тренировка добавлена!

source: Edit Training
ru: Изменить тренировку

source: Fill the form to edit training
ru: Заполните форму, чтобы изменить тренировку

source: Training edited!
ru: Тренировка изменена!

source: Trainings list
ru: Список тренировок

source: No trainings
ru: Нет тренировок

source: Training information
ru: Инофрмация о тренировке

source: Training
ru: Тренировка

source: No description
ru: Описание отсутствует

# noExercisesYetPress
source: No exercises yet. Press 'Add exercise' button to create one.
ru: Ещё нет упражнений. Нажмите кнопку 'Добавить упражнение' для добавления

source: No exercises yet.
ru: Ещё нет упражнений.

source: Start training
ru: Начать тренировку

source: Finish training
ru: Закончить тренировку

source: Finish
ru: Закончить

source: New exercise title
ru: Название нового упражнения

source: New exercise description (optional)
ru: Описание нового упражнения (необязательно)

source: Enter sets count
ru: Введите количество подходов

source: Enter reps count
ru: Введите количество повторений

source: New training title
ru: Название новой тренировки

source: New training description (optional)
ru: Описание новой тренировки (необязательно)

source: Add exercise
ru: Добавить упражнение

source: Create a new exercise
ru: Создать новое упражнение

source: Enter integer number
ru: Введите целое число

source: Enter valid integer number
ru: Введите целое число правильно

source: {sets} set(s) of {duration}
ru: {sets} подход(-а/-ов) по {duration}

source: {sets} set(s) of {N} rep(s)
ru: {sets} повтор(-а/-ов) по {N} повторен.

source: Exercise editing
ru: Изменение упражнения

source: Add some exercises to start this training
ru: Добавьте упражнения, чтобы начать уту тренировку

source: Watch Statistics
ru: Смотреть статистику

source: Edit weight
ru: Изменение веса

source: Here you can change your current weight
ru: Здесь вы можете изменить свой вес

source: Weight updated!
ru: Вес изменён!

source: Your current weight is:
ru: Ваш вес:

source: Change weight
ru: Изменить вес

source: Enter your weight
ru: Введите ваш вес

source: Apply
ru: Подтвердить

source: Interface language
ru: Язык интерфейса

source: Create product
ru: Создать продукт

# noProductsYetnPressPlusButtonToCreateANew
source: No products yet. Tap 'Plus' button to create a new product
ru: Пока продуктов нет. Нажмите иконку плюса, чтобы создать новый продукт

# noMealsYetnPressPlusButtonToCreateANew
source: No meals yet. Tap 'Plus' button to create a new meal
ru: Пока блюд нет. Нажмите иконку плюса, чтобы создать новое блюдо

# noTrainingsYetNTapPlusIconToCreateA
source: No trainings yet. Tap 'Plus' icon to create a new training
ru: Пока тренировок нет. Нажмите иконку плюса, чтобы создать новую тренировку

source: Statistics of {exerciseTitle}
ru: Статистика {exerciseTitle}

# noStatisticsForThisExerciseYetntoMakeStatisticsOfThis
source: No Statistics for this exercise yet. To get it's statistics, complete a training this exercise is a part of.
ru: Пока нет Статистики по этому упражнению. Чтобы получить его статистику, завершите тренировку, в которую оно входит.

source: Select language
ru: Выберите язык

source: Date
ru: Дата

source: An error occurred
ru: Произошла ошибка

source: Exercise added
ru: Упражнение добавлено

source: Create training
ru: Создать тренировку

source: Create meal
ru: Создать блюдо

# noProductsncreateAProductFirstToAddItAsAn
source: No products! Create a product first to add it as an ingredient.
ru: Нет продуктов! Сначала создайте продукт, чтобы добавить его как ингредиент.

source: Go to products
ru: Перейти к продуктам

source: Measurement unit:
ru: Единицы измерения:

source: Could not load user data.
ru: Не удалось загрузить данные пользователя.

source: Could not create user.
ru: Не удалось создать пользователя.

source: Could not update user weight.
ru: Не удалось изменить вес пользователя.

source: Could not create a new training.
ru: Не удалось создать новую тренировку.

source: Could not delete training.
ru: Не удалось удалить тренировку.

source: Could not edit training.
ru: Не удалось изменить тренировку.

source: Could not add exercise in training.
ru: Не удалось добавить упражнение в тренировку.

source: Could not edit exercise in training.
ru: Не удалось измениить упражнение в тренировке.

source: Could not delete exercise from training.
ru: Не удалось удалить упражнение из тренировки.

# couldNotCompleteTraining
source: Could not update training data.
ru: Не удалось обновить данные тренировки.

source: Could not create a new meal
ru: Не удалось создать новое бюлдо.

source: Could not delete meal.
ru: Не удалось удалить блюдо.

source: Could not edit meal.
ru: Не удалось изменить блюдо.

source: Could not add ingredient in meal.
ru: Не удалось добавить ингредиент в блюдо.

source: Could not edit ingredient in meal.
ru: Не удалось изменить ингредиент в блюде.

source: Could not delete ingredient from meal.
ru: Не удалось удалить ингредиент из блюда.

source: Could not create a new product.
ru: Не удалось создать новый продукт.

source: Could not edit product
ru: Не удалось изменить продукт.

source: Could not delete product.
ru: Не удалось удалить продукт.

source: Training deleted.
ru: Тренировка удалена.

source: Training finished.
ru: Тренировка завершена.

source: Meal deleted.
ru: Блюдо удалено.

source: Product deleted.
ru: Продукт удалён.

source: ingredient
ru: ингредиент

source: meal
ru: блюдо

source: product
ru: продукт

source: exercise
ru: упражнение

source: Tap to open timer
ru: Нажмите, чтобы открыть таймер

source: Mark as completed
ru: Отметить как выполненное

source: Exercise information
ru: Информация об упражнении

# goodWorknYourTrainingProgressHasBeenUpdated
source: Good work! Your training progress has been updated!
ru: Хорошая работа! Ваш тренировочный прогресс был обновлён!

source: Check statistics
ru: Перейти к статистике

# hundredMeasurementContain
source: 100 {measurement} contain:
ru: 100 {measurement} содержат:

# millilitersShort
source: ml.
ru: мл.

# gramsShort
source: gr.
ru: гр.
